articles/zsh_zle.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-18 Sun 23:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>zsh command line editting</title>
<meta name="author" content="Harumi Kiyama" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" />
                                    <link rel="stylesheet" type="text/css" href="/css/htmlize.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="nav">
                                     <a href="/index.html" class="button">Home</a>
                                     <a href="/rss.xml" class="button">RSS</a>
                                     <a href="/about_me.html" class="button">About</a>
                                   </nav>
                                   <hr>
</div>
<div id="content" class="content">
<h1 class="title">zsh command line editting</h1>
<div class="post-status"><span><i class='bx bx-calendar'></i>
<span>2024-08-14</span></span>
<span><i class='bx bx-edit'></i><span>2024-08-18 Sun 19:27</span></span></div><div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4020e8c">1. 前言</a></li>
<li><a href="#org9d08363">2. zsh 的 keymap</a></li>
<li><a href="#orgcad0fac">3. zsh 自定义 keymap</a></li>
<li><a href="#org4b1a355">4. 后记</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4020e8c" class="outline-2">
<h2 id="org4020e8c"><span class="section-number-2">1.</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>zsh</i> 在提供了很多的内置命令以及自己一套的配置系统之外还提供了非常方便的命令行编
辑功能. 所谓的命令行编辑, 就是可以在命令行中以 <i>Emacs</i> 或者 <i>VIM</i> 的 <i>keymap</i>
去进行编辑. 此外 <i>zsh</i> 还提供了一些可以自定义 <i>keymap</i> 的命令, 比如 <i>keybind</i> 等
</p>
</div>
</div>
<div id="outline-container-org9d08363" class="outline-2">
<h2 id="org9d08363"><span class="section-number-2">2.</span> zsh 的 keymap</h2>
<div class="outline-text-2" id="text-2">
<p>
在 <i>zsh</i> 中所谓的 <i>keymap</i> 是按键序列和 <i>zsh</i> 命令行编辑命令的一个映射.
</p>

<p>
<i>zsh</i> 一共提供了 8 个内置的 <i>keymap</i>, 分别是
</p>
<ul class="org-ul">
<li>emacs  EMACS emulation</li>
<li>viins  vi emulation - insert mode</li>
<li>vicmd  vi emulation - command mode</li>
<li>viopp  vi emulation - operator pending</li>
<li>visual vi emulation - selection active</li>
<li>isearch
incremental search mode</li>
<li>command
read a command name</li>
<li>.safe  fallback keymap</li>
</ul>
<p>
其中, <i>emacs keymap</i> 为对 <i>Emacs</i> 的命令的一个模拟, 比如 <i>C-f</i> 会让光标向前移动
一格, <i>C-b</i> 会让光标向后移动一格. <i>viins vincmd viopp visual</i> 这些都是为了模拟
<i>VIM</i> 的不同模式, 而不得不生成的 <i>keymap</i>. 个人建议纯用 <i>emacs</i> 的 <i>keymap</i> 就够
了. <i>zsh</i> 默认状态下是启用 <i>Emacs</i> 模式的, 只有在 <i>VISUAL</i> 或者 <i>EDITOR</i> 这两个
环境变量中包含有 <i>vi</i> 才会启用 <i>VIM</i> 模式.
<i>.safe keymap</i> 为后备模式, 即只有在无法进入 <i>viins</i> 等 <i>VIM keymap</i> 或者 <i>emacs keymap</i>
才会进入 <i>.safe keymap</i>. 在这个 <i>keymap</i> 中, 每个按键的意义 (除了 ^J 和 ^M 外)
都只是插入自身 (<code>self-insert</code>).
在 <i>emacs keymap</i> 下按 <i>M-x</i> 可以进入 <i>command keymap</i>, 按 <i>C-s</i> 或者 <i>C-r</i> 可以
进入 <i>isearch keymap</i>.
</p>
</div>
</div>
<div id="outline-container-orgcad0fac" class="outline-2">
<h2 id="orgcad0fac"><span class="section-number-2">3.</span> zsh 自定义 keymap</h2>
<div class="outline-text-2" id="text-3">
<p>
<i>zsh</i> 提供了工具 <i>bindkey</i> 可以让用户对 <i>keymap</i> 进行操作, 比如在特定的 <i>keymap</i>
中添加新的按键顺序与编辑命令的映射. 如果想要在 <i>emacs keymap</i> 中加入 <i>C-g</i> 对应
光标向前移动可以在命令行中或者 <i>zsh</i> 的配置文件中加入 <code>bindkey -e ^G
forward-char</code>.
其中 <i>forward-char</i> 是一个内置的 <i>widget</i>, 所谓的 <i>widget</i> 是 <i>zsh</i> 当中实现了一
些小功能的一个单位, 在 <i>kepmap</i> 中和按键顺序对应的只能是 <i>widget</i>. 用 <i>emacs</i> 中
的术语来解释的话就是类似 <i>interactive function</i> 的东西.
</p>
</div>
</div>
<div id="outline-container-org4b1a355" class="outline-2">
<h2 id="org4b1a355"><span class="section-number-2">4.</span> 后记</h2>
<div class="outline-text-2" id="text-4">
<p>
这里只是对于 <i>zsh command line editing</i> 做了一个比较简略的介绍, 如果对这一部分比
较有兴趣可以通过 <code>man zshzle</code> 来阅读很多的资料.
</p>
</div>
</div>
</div>
<script src="https://giscus.app/client.js"
        data-repo="HarumiKiyama/HarumiKiyama.github.io"
        data-repo-id="MDEwOlJlcG9zaXRvcnkxMTcxMjczMjQ="
        data-category="[ENTER CATEGORY NAME HERE]"
        data-category-id="[ENTER CATEGORY ID HERE]"
        data-mapping="pathname"
        data-strict="0"
        data-reactions-enabled="1"
        data-emit-metadata="0"
        data-input-position="bottom"
        data-theme="light_high_contrast"
        data-lang="en"
        crossorigin="anonymous"
        async>
   </script><div id="postamble" class="status">
<hr class="Solid">
                                   <div class="info">
                                     <span class="author">Author: Harumi Kiyama (<a href="mailto:lucius0720@hotmail.com">lucius0720@hotmail.com</a>)</span>
                                     <span class="date">Create Date: 2024-08-14</span>
                                     <span class="date">Last modified: 2024-08-18 Sun 19:27</span>
                                     <span>Creator: Emacs 31.0.50 (Org mode 9.7.9)</span>
                                   </div>
</div>
</body>
</html>
